package ru.gb.krusser; 
  /**
  * Декоратор. Он декорирует, то есть, накладывает на результат декорации.
  * Внешний вид важен, поэтому этот класс существует.
  **/

public class Decorator {
  /**
  * Функция умножения двух целых чисел
  * @param a первый множитель
  * @param b второй множитель
  * @return произведение a и b, без проверки на переполнение переменной.
  **/

   public static int sub(int a, int b) {
      return a - b; // возврат без проверки переполнения
   }
   /**
   * Функция вычитания двух целых чисел
   * @param a уменьшаемое
   * @param b вычитаемое
   * @return разность a и b, без проверки на переполнение переменной.
   **/

    public static String decorate(int a) {
    /**
    * Метод декорирует число, добавляя к нему строку
    * при помощи функции форматирования строк
    * Функция декорирования числа для вывода в консоль в виде строки с преамбулой 'Вот Ваше число'
    * @param a число, требующее декорации
    * @return Отформатированная строка.
    **/

      return String.format("Here is your number: %d.", a);
    }
}
